{
    "product_name": "Daily Ritual Women's Corduroy 5-Pocket Skinny Pant",
    "product_price": "$11.68 - $29.00",
    "number_reviews": "30",
    "ratings": "2.8",
    "reviews": [
        {
            "review_text": "These could use a little more contour or stretch. The waist stands off of my body and the pants slip down annoyingly and require a belt (cinched pretty tight) to keep from losing them completely. Bear in mind, I don't have a tiny waist. I was hoping for thicker fabric for warmth to wear with boots and a sweater. I would classify these as \"summer weight\" corduroy. Which seems like it shouldn't be a thing, but apparently is. I wear a size 8-10.",
            "review_posted_date": "10 Mar 2019",
            "review_header": "Lightweight fabric, not contoured properly for curves",
            "review_rating": "3.0 ",
            "review_author": "That Girl Said"
        },
        {
            "review_text": "I loved the look of these corduroy leggings, but as you wear them throughout the day they tend to really, really stretch out. They fit good at the beginning when I first put them on and by the afternoon they are baggy. I had to send them back.",
            "review_posted_date": "16 Jan 2019",
            "review_header": "Get stretched out a lot as the day goes on....",
            "review_rating": "2.0 ",
            "review_author": "R.L."
        },
        {
            "review_text": "These are really nice, lightweight, and soft cords. The other reviewers are correct, they fit very snug in the legs but are a bit loose in the hips and waist. They did not shrink in the dryer (I was kind of hoping they would) but the quality is nice and for the price, I am really happy to add these to my fall/winter rotation. Also, I love the color! Exactly as pictured.",
            "review_posted_date": "18 Jan 2019",
            "review_header": "Cute and comfortable",
            "review_rating": "4.0 ",
            "review_author": "Amazon Customer"
        },
        {
            "review_text": "These ran small, with no stretch. They are also not made for taller women, I'm 5'9\" and they hit above the ankle and are almost low rise. Order up a size. I returned them.",
            "review_posted_date": "22 Mar 2019",
            "review_header": "Runs small, not for tall women.",
            "review_rating": "3.0 ",
            "review_author": "Bridget McKay"
        },
        {
            "review_text": "The pants were way too large around my waste which led to me pulling them up constantly. The material is not of good quality, I wore them maybe four times in less than a month and I already have a hole by my back pocket and my knees look extremely worn.",
            "review_posted_date": "29 Apr 2019",
            "review_header": "Not worth it",
            "review_rating": "1.0 ",
            "review_author": "Anna"
        },
        {
            "review_text": "These corduroy pants are truly too tight. I bought them to be able to wear them under my Frye boots which I could but they’re uncomfortably too tight. I will donate them.",
            "review_posted_date": "02 Dec 2018",
            "review_header": "Way too tight!",
            "review_rating": "2.0 ",
            "review_author": "Chris"
        },
        {
            "review_text": "Fit is a bit off. If you have ulta thin calves with no muscle and a hips or a pronounced abdomen these will work for you. Odd proportions. If",
            "review_posted_date": "19 Dec 2018",
            "review_header": "Odd fit",
            "review_rating": "3.0 ",
            "review_author": "SD"
        },
        {
            "review_text": "These tore the second time I wore them! Not good! But I loved the color:(.",
            "review_posted_date": "28 Mar 2019",
            "review_header": "Material was weak",
            "review_rating": "1.0 ",
            "review_author": "Cristy Lafferty"
        },
        {
            "review_text": "I read the reviews about these pants and thought these would be perfect for me as I have a larger waist and skinny legs. But even for me these were too big in the waist",
            "review_posted_date": "06 Apr 2019",
            "review_header": "The reviews are true",
            "review_rating": "1.0 ",
            "review_author": "AliReg"
        },
        {
            "review_text": "My wife is 6ft. It’s hard to find pants for her due to her Lang legs. These, though cute, just didn’t fit",
            "review_posted_date": "13 Mar 2019",
            "review_header": "Cute but small",
            "review_rating": "2.0 ",
            "review_author": "Eric Antrim"
        },
        {
            "review_text": "I love these pants! They are a mid-high rise skinny pant that hugs the right places. They are a true \"skinny pant\" meaning if you have thicker calves or thighs, they may not work. I am 5'10 and normally a size 8...these are a size 10 and fit perfectly, so definitely size up one size for a correct fit. The length is truly an ankle length on average height people, but with me being a bit taller they hit slightly above the ankle which still looks cute. They have a nice stretch to them and don't sag at the end of the day as some stretchy pants do. I love the fabric. It is a medium weight corduroy that keeps me warm. I wash all of my clothes in a delicate cycle and hang to dry and these pants have done well that way. I would hesitate to dry them in the dryer, as they may shrink. These pants look great for my casual office environment and I can also wear them to run errands or volunteer at my child's school without them being \"too casual\" or \"too dressy.\" They are the perfect in-between, versatile piece that pairs well with a casual sweater or a nice blouse and you can dress them up or down with sneakers or a fun heel.",
            "review_posted_date": "30 Oct 2018",
            "review_header": "Runs a bit small, so size up one size for proper fit",
            "review_rating": "5.0 ",
            "review_author": "FLFamily"
        },
        {
            "review_text": "These Daily Ritual Woman's Corduroy 5-Pocket Skinny pants in battleship gray are pretty accurate in sizing. I'm a US Women's size 4-6, more \"weighted\" towards 6 lately. These pants fit snugly, but not at all uncomfortably, and considering their tight looking fit, they feel pretty good all around, with just a very light stretch to them. I can even sit cross legged in them on the ground w no problem. The waistband feels roomy and non-binding. The corduroy has very thin ridges, and you can't even tell it's corduroy from a few feet away- it just looks kinda velvety. I read that corduroy is coming back in style- and particularly in men's clothing. I like it because i'm a tactile person, love texture, and these are very nice pants.",
            "review_posted_date": "24 Oct 2018",
            "review_header": "Comfortable and Soft, Well-Fitted Accurate Sizing",
            "review_rating": "5.0 ",
            "review_author": "KC"
        },
        {
            "review_text": "These are a serviceable corduroy pant in the mid-price range, but I much prefer my AG cords. When you do a side by side comparison, the quality difference is clear. This material is stiffer, itchier and doesn't keep its shape as well. What this means is that although when I pull them on the pant is super skin tight, after a few hours of moving around, the material stretches out and sags. I usually wear a 6 and these are an 8. They fit perfectly snugly around the waist at first, so I would have advised to size up ... however, after 3 hours, the waist was not only no longer snug, it was positively gaping. Which, okay, I can wear a belt so it's not that big of a deal, but my AG cords don't do this. I should also warn that the legs are incredibly tight, so tight in fact I had trouble getting in and out of them and my legs aren't especially thick. I do love that the front pockets are actual usable pockets rather than fake pockets. And the dark grey color is really great.",
            "review_posted_date": "27 Oct 2018",
            "review_header": "Pretty good",
            "review_rating": "3.0 ",
            "review_author": "DJLA531"
        },
        {
            "review_text": "- Cord material feels great. Small ridges. Not thin but not bulky heavy - I guess everyone knows they're got 5 pockets. All usable size - Made in Bangladesh - 1 tag, easy remove - Machine wash cold, gentle, non-chlorine bleach if need. Tumble low. Iron warm. - About half an inch stretch in waist, a bit more in the seat, tapers down the leg - Stitching looks good The legs are really skinny. Maybe the skinniest I've seen, even with some stretch. Too much for me, but if you got the legs for it, it's a good option. Don't forget to use the Smile.Amazon.com address - It's an Amazon program where many things you buy every day will generate a small donation to the charity of your choice. Read about it here: https://smile.amazon.com/gp/chpf/about/ref=smi_se_rspo_laas_aas",
            "review_posted_date": "17 Oct 2018",
            "review_header": "Well constructed but very skinny legs",
            "review_rating": "4.0 ",
            "review_author": "🌈 KT"
        },
        {
            "review_text": "These are nice pants and I mostly like them, but the legs, especially around the ankles, are tiny. While I love Daily Ritual, I've had a hard time getting the sizing right for the pants, because they vary so greatly on the sizing, even from different colors of the exact same pants. After losing a great deal of weight and gaining a bit of it back, I wasn't initially sure what size I'd wear. 12 seems to be my average right now, though, until I get the extra off again. Some 12s I've tried from Daily Ritual have been way too loose, while some of them have been too tight for me to tolerate. (While I prefer a skinny design, I don't care for tight pants. I also don't want them sagging, so that I have to pull them up constantly.) All that I've tried so far do stretch through the day, though, except for the ankle part. For this pair, the top does start out on the snug side for my tastes, but it's fine. Based on several pair I've tried, these corduroy ones do fit on the snugger side for 12s. (A white pair I tried was the snuggest and a light stone wash pair I tried were the loosest. I think a 10 would have been perfect in those.) If you don't mind the lower legs being super skinny, I can easily recommend giving them a try, but be prepared for a bit of effort getting the right size.",
            "review_posted_date": "22 Feb 2019",
            "review_header": "Tiny ankles...",
            "review_rating": "4.0 ",
            "review_author": "Bluerose's Heart"
        },
        {
            "review_text": "These cords are soft, lightweight basics with a classic skinny fit. The bit of stretch makes them very comfortable and forgiving. I'm currently wearing them after a rather indulgent vacation that makes me a big nervous to step on the scale, and they're still very comfortable, despite my vacation muffin tops. While very comfy, the thinner fabric puts them more in jeggings than pants territory if you're plump. (They do still have proper pockets, at least.) The waist is a good fit for big-hipped women--often jeans and cords gap at my waist, giving me plumber's butt. These fit as they should, classic jeans-style rise, neither high nor low.",
            "review_posted_date": "23 Nov 2018",
            "review_header": "Nice skinny basic, comfortable and forgiving, a bit thin.",
            "review_rating": "4.0 ",
            "review_author": "Cupcake"
        },
        {
            "review_text": "I am a 12-14 and I got a 14. The legs on these are skin tight and I have thin legs for a size 14 girl. They fit well around my top. They didn't go up too high or down too low. Really sit nice on your legs. They do have a bit of stretch to them but if you have to ware a wide calf boot or have trouble with your thighs fitting skinny jeans I would pass on these. They are soft inside and comfortable. It has small girl pockets in front and large back pockets. I don't think I will keep these. I have a nice round but, and front and this makes me look like two toothpicks holding up a round ball. Not a great look. I am not a huge fan of skinny jeans but told the daughters I'd try. As soon as they saw these on my tho they agreed with me:} So the jeans are a 4 star on my body a 2 star.",
            "review_posted_date": "10 Oct 2018",
            "review_header": "Tight on the legs.",
            "review_rating": "4.0 ",
            "review_author": "LoveBooks"
        },
        {
            "review_text": "These are well made for mid to low priced skinny cords. Seams are nicely finished inside. Waist is just a tad in the high side but not enough that I’d call them high waisted. Length is average which for me at 5’3” is a bit long (but manageable with skinnies). However these run small. The hips and but are small, definitely size up if you’re between. The legs are even smaller, especially lower legs. They don’t have a ton of stretch which is nice for avoiding the dreaded pajam jeans look but means you really need to size up for comfort. This was surprising because the Daily Ritual tops and dresses have run on the larger side I typically wear a 29 comfortably but a 10 is a little too snug.",
            "review_posted_date": "31 Oct 2018",
            "review_header": "Runs small",
            "review_rating": "4.0 ",
            "review_author": "Stepone"
        },
        {
            "review_text": "These definitely are skinny jeans, particularly through the lower part of the legs. Happily there is a certain amount of stretch in the fabric so they do fit and are comfortable. Other than the lower leg the jeans fit snuggly but not particularly tight, in fact they could be a bit tighter through the butt. The color is a nice medium gray, the fabric is a pinwale corduroy and they have classic jeans styling.",
            "review_posted_date": "07 Oct 2018",
            "review_header": "Nice looking skinny jeans",
            "review_rating": "5.0 ",
            "review_author": "Jeanne Tassotto"
        },
        {
            "review_text": "These have very narrow/tight legs. Even though I knew from the reviews that these were very skinny jeans, I was surprised and dismayed to learn that the leg openings are so narrow that I really cannot get my feet into them without a major struggle. I do have feet that are not narrow, and I do have a high instep. Still.....I think it’s ridiculous to make the leg openings so narrow that you can’t actually get the pants over your feet. So: I would caution would-be purchasers: don’t buy these unless your feet are in the small and narrow range (smaller than 7.5 M).",
            "review_posted_date": "01 Nov 2018",
            "review_header": "Leg openings are VERY narrow.",
            "review_rating": "3.0 ",
            "review_author": "Worddancer Redux"
        }
    ]
}